//Написание простой консольной бродилки. Практика C#

using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace SharpPractice
{
    internal class ConsoleGame
    {
        public void Game()
        {
            Console.CursorVisible = false;
            Console.SetWindowSize(75, 35);

            int startX = 16, startY = 1;
            bool exitFlag = true;
            char[,] map =
            {
                {'|','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','|'},
                {'|',' ',' ','#','#',' ',' ',' ',' ',' ',' ','#','#','#',' ',' ','#',' ',' ','#','#',' ',' ',' ','#','#',' ',' ',' ',' ',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ','|'},
                {'|','#',' ','#',' ',' ','#','#','#',' ',' ',' ',' ',' ','#','#','#','#',' ',' ',' ',' ','#',' ',' ','#','#',' ','#','#',' ','#',' ','#','#','#',' ','#','#','#',' ','|'},
                {'|',' ',' ',' ','#',' ','#',' ','#',' ','#',' ','#',' ','#','X',' ','#','#',' ','#',' ','#','#',' ','#','#',' ',' ','#',' ',' ',' ','#',' ','#',' ','#',' ',' ',' ','|'},
                {'|',' ',' ','#',' ',' ','#',' ','#','#','#',' ','#',' ','#','#',' ',' ','#',' ','#',' ',' ','#',' ',' ','#','#','#',' ',' ','#',' ','#',' ',' ',' ',' ','#','#',' ','|'},
                {'|',' ','#','#','#',' ',' ',' ','#',' ',' ',' ','#',' ','#','#','#',' ',' ',' ','#',' ',' ','#','#',' ',' ',' ','#',' ',' ','#','#',' ',' ',' ','#','#',' ',' ',' ','|'},
                {'|',' ','#','#',' ',' ','#',' ','#',' ',' ','#','#',' ',' ',' ','#','#','#',' ','#',' ',' ','#',' ',' ','#',' ','#','#',' ','#',' ',' ','#','#','#',' ',' ','#',' ','|'},
                {'|',' ',' ','#',' ',' ','#',' ','#','#',' ',' ','#','#',' ',' ','#','#','#',' ','#',' ',' ','#','#',' ','#',' ','#',' ',' ','#',' ','#','#',' ','#',' ','#','#',' ','|'},
                {'|','#',' ',' ',' ','#',' ',' ',' ','#',' ',' ','#',' ','#',' ','#',' ','#',' ',' ',' ',' ','#',' ',' ','#','X','#',' ','#','#','X','#','#',' ','#',' ',' ','#',' ','|'},
                {'|','#',' ','#','#','#',' ','#','#','#','#',' ','#','#','#',' ','#',' ','#',' ','#','#',' ',' ','#',' ','#','#','#',' ','#','#','#','#','#',' ','#','#',' ','#','#','|'},
                {'|','X',' ','#',' ','#',' ','#','#','#',' ',' ','#',' ',' ',' ','#',' ',' ','#',' ',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ','#','#',' ',' ',' ','|'},
                {'|','#','#','#',' ',' ',' ','#',' ','X','#',' ','#',' ',' ','#','#',' ','#',' ','#',' ','#',' ','#','#',' ',' ','#',' ','#','#','#','#','#',' ',' ','#','#','#',' ','|'},
                {'|',' ','X',' ',' ','#',' ','#',' ','#','#',' ','#',' ','#','#',' ',' ',' ',' ','#',' ',' ',' ',' ','#',' ',' ','#',' ',' ','#',' ','#',' ','#','#','#',' ','#',' ','|'},
                {'|',' ','#','#','#',' ','#','#',' ','#','#',' ','#',' ','#',' ','#',' ','#','#','#',' ','#',' ',' ','#','#','#',' ','#',' ','#',' ','#',' ','#',' ',' ',' ','#','X','|'},
                {'|',' ','#','X','#',' ','#',' ',' ','#',' ',' ','#',' ',' ',' ','#','#','#','X',' ',' ','#',' ','#',' ',' ','#',' ',' ',' ',' ',' ','#',' ','#',' ','#',' ','#','#','|'},
                {'|',' ','#',' ',' ',' ','#',' ','#','#',' ','#','#','#','#',' ','#',' ','#','#',' ','#','#',' ','#',' ',' ',' ','#',' ',' ','#',' ','#','#','#',' ','#',' ',' ',' ','|'},
                {'|',' ','#',' ','#',' ',' ',' ',' ',' ',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ',' ',' ',' ',' ',' ',' ','#','#',' ',' ',' ',' ',' ',' ','#','#','#','X','|'},
                {'|','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','|'},
            };

            int pack = 0;
            DateTime startTime = DateTime.Now;

            while (exitFlag)
            {
                for (int i = 0; i < map.GetLength(0); i++)
                {
                    for (int j = 0; j < map.GetLength(1); j++)
                    {
                        Console.Write(map[i, j]);
                    }
                    Console.WriteLine();
                }

                //Meta-информация по игре
                Console.SetCursorPosition(0, 25);
                Console.WriteLine("*Правила игры:\n\n-Ваш персонаж обозначен на карте символом @ и изначально располагается\nв нижнем левом углу карты." +
                    "\n-Ваша задача: собрать все сокровища на карте, обозначенные знаком X.\n-Проходить свозь стены и забор, обозначенные символами | и #\n" +
                    "соответственно, вы не можете.\n-Управление: стрелочки вверх, вниз, влево, вправо на клавиатуре.\n\nХорошей игры!)");
                Console.SetCursorPosition(50, 6);
                Console.WriteLine("КОНСОЛЬНАЯ ИГРА");
                Console.SetCursorPosition(49, 8);
                Console.WriteLine("\"Treasure Hunter\"");
                Console.SetCursorPosition(44, 0);
                Console.WriteLine("Для завершения нажмите \"Enter\"");

                Console.SetCursorPosition(49, 14);
                Console.Write("Время прохождения:\n");
                Console.SetCursorPosition(49, 16);
                Console.WriteLine("{0} минут, {1} секунд", (DateTime.Now - startTime).Minutes, (DateTime.Now - startTime).Seconds);

                Console.SetCursorPosition(0, 20);
                Console.Write("Рюкзак с вашими сокровищами: ");

                if (pack < 10)
                {
                    for (int i = 0; i < pack; i++)
                    {
                        Console.Write("X ");
                    }
                }
                else
                {
                    break;
                }

                Console.SetCursorPosition(0, 21);
                Console.Write($"Осталось собрать: {10 - pack}");

                Console.SetCursorPosition(startY, startX);
                Console.Write('@');

                ConsoleKeyInfo pressedKey = Console.ReadKey();

                switch (pressedKey.Key)
                {
                    case ConsoleKey.UpArrow:
                        if (map[startX - 1, startY] != '#')
                        {
                            startX--;
                        }
                        break;
                    case ConsoleKey.DownArrow:
                        if (map[startX + 1, startY] != '#')
                        {
                            startX++;
                        }
                        break;
                    case ConsoleKey.RightArrow:
                        if (map[startX, startY + 1] != '|' && map[startX, startY + 1] != '#')
                        {
                            startY++;
                        }
                        break;
                    case ConsoleKey.LeftArrow:
                        if (map[startX, startY - 1] != '|' && map[startX, startY - 1] != '#')
                        {
                            startY--;
                        }
                        break;
                    case ConsoleKey.Enter:
                        exitFlag = false;
                        break;
                }

                if (map[startX, startY] == 'X')
                {
                    map[startX, startY] = ' ';
                    pack++;
                }

                Console.Clear();
            }
            if (exitFlag)
            {
                Console.Clear();
                Console.SetCursorPosition(23, 13);
                Console.WriteLine("Поздравляем, вы победили!!!");
                Console.SetCursorPosition(16, 15);
                Console.WriteLine("Для завершения нажмите любую клавишу дважды");
                Console.SetCursorPosition(12, 21);
                Console.Write("Ваше время прохождения составило: {0} минут, {1} секунд", (DateTime.Now - startTime).Minutes, (DateTime.Now - startTime).Seconds);
            }
            else
            {
                Console.SetCursorPosition(23, 13);
                Console.WriteLine("Очень жаль, что уже уходите(");
                Console.SetCursorPosition(17, 15);
                Console.WriteLine("Для завершения нажмите любую клавишу дважды");
                Console.SetCursorPosition(19, 21);
                Console.Write("Ваша игра длилась: {0} минут, {1} секунд", (DateTime.Now - startTime).Minutes, (DateTime.Now - startTime).Seconds);
            }
        }
    }
}